# هدف: معرفی و کار با ساختار شرطی if در پایتون، شامل استفاده از تورفتگی، عملگرهای منطقی و مقایسه‌ای، شرط‌های تو در تو، و استفاده از elif و else


# ساختار پایه if :
x = 10
if x > 5:
    print("x بزرگتر از 5 است")

# تورفتگی (Indentation) :
x = 10
if x > 11:
    print("x بزرگتر از 11 است")
else:
    print("x کوچکتر است")

# عملگرهای مقایسه‌ای و منطقی :
x = 7
y = 9
if x > 5 and y < 10:
    print("هر دو شرط درست هستند")

# ارزیابی‌های شرطی :
if "hello":
    print("این چاپ خواهد شد")
if 0:
    print("این چاپ نخواهد شد")

# شرط‌های تو در تو (Nested Conditions) :
x = 10 
if x > 5:
    print("x بزرگتر از 5 است")
    if x > 8:
        print("x همچنین بزرگتر از 8 است")

# استفاده از elif و else :
x = 15
if x > 20:
    print("x بزرگتر از 20 است")
elif x > 10:
    print("x بزرگتر از 10 است اما کمتر از یا برابر با 20 است")
else:
    print("x برابر با 10 یا کمتر است")
